cask_args appdir: '/Applications'

tap 'shopify/shopify'
tap 'localstack/tap'

# languages & package managers
# brew 'esy'
brew 'mas'
brew 'python'
brew 'python3'
brew 'pipenv'

# shell
brew 'zsh'
brew 'zsh-completions'

# source code control
brew 'git'
brew 'git-lfs'

# codecs
brew 'flac'
brew 'lame'
brew 'libogg'

# utils
brew 'ack'
brew 'bcal'
brew 'coreutils'
brew 'gawk'
brew 'gcc'
brew 'gnu-sed'
brew 'grep'
brew 'hub'
brew 'jq'
brew 'p7zip'
# brew 'sox', args: [ 'with-flac', 'with-libvorbis']
# brew 'unrar'
cask 'xquartz'

# desktop environment
# brew 'yabai'
cask 'raycast'

# core software
brew 'bat'
brew 'btop'
brew 'eza'
brew 'delta'
brew 'doggo'
brew 'fd'
brew 'feh'
brew 'fzf'
cask 'kitty'
brew 'mpd'
brew 'mpv'
brew 'ncmpcpp'
brew 'neofetch'
brew 'nnn'
brew 'pinentry-mac'
brew 'procs'
brew 'ripgrep'
brew 'task'
brew 'xh'
brew 'zellij'
brew 'zoxide'

# docker
cask 'orbstack'

# kubernetes
brew 'kubernetes-cli'
cask 'minikube'

# editors
brew 'neovim'
cask 'cursor'
cask 'sublime-text'

# dev
# brew 'act'
brew 'awscli'
# cask 'fastlane'
brew 'gh'
cask 'google-cloud-sdk'
cask 'insomnia'
brew 'lazydocker'
# brew 'localstack-cli
# brew 'shellcheck'
# brew 'watchman'

# browsers
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'arc'

# quicklook providers
# cask 'provisionql'

# password managers
cask '1password'

# misc
cask 'obsidian'
