cask_args appdir: '/Applications'

tap 'shopify/shopify'

# languages & package managers
# brew 'esy'
brew 'mas'
brew 'python'
brew 'python3'
brew 'pipenv'

# shell
brew 'zsh'
brew 'zsh-completions'

# source code control
brew 'git'
brew 'git-lfs'

# codecs
brew 'flac'
brew 'lame'
brew 'libogg'

# utils
brew 'ack'
brew 'bcal'
brew 'gcc'
brew 'hub'
brew 'jq'
brew 'p7zip'
# brew 'sox', args: [ 'with-flac', 'with-libvorbis']
# brew 'unrar'
cask 'xquartz'

# desktop environment
# brew 'yabai'
cask 'raycast'

# core software
brew 'aria2'
brew 'feh'
brew 'fff'
brew 'fzf'
cask 'kitty'
brew 'mpd'
brew 'mpv'
brew 'ncmpcpp'
brew 'neofetch'
brew 'nnn'
brew 'pinentry-mac'
brew 'ripgrep'
brew 'task'
brew 'tmux'
brew 'w3m'

# fonts
cask 'font-fantasque-sans-mono'
cask 'font-fira-code'

# docker
cask 'orbstack'

# kubernetes
brew 'kubernetes-cli'
cask 'minikube'

# editors
brew 'neovim'
cask 'cursor'
cask 'sublime-text'

# dev
# brew 'act'
# brew 'watchman'
# brew 'shellcheck'
cask 'google-cloud-sdk'
# cask 'fastlane'

# browsers
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'

# quicklook providers
# cask 'provisionql'

# password managers
# cask '1password'

# misc
cask 'obsidian'
# cask 'krita'
# brew 'transmission'
# cask 'plex-media-server'
# cask 'station'
# cask 'notion'
