cask_args appdir: '/Applications'

# shell
brew 'zsh'
brew 'zsh-completions'

# source code control
brew 'git'
brew 'git-lfs'

# utils
brew 'coreutils'
brew 'gawk'
brew 'gcc'
brew 'gnu-sed'
brew 'grep'
brew 'jq'
brew 'p7zip'

# desktop environment
cask 'raycast'

# core software
brew 'bat'
brew 'btop'
brew 'chezmoi'
brew 'gnupg'
brew 'eza'
brew 'delta'
brew 'doggo'
brew 'fastfetch'
brew 'fd'
brew 'fzf'
cask 'ghostty'
cask 'kitty'
brew 'pinentry-mac'
brew 'procs'
brew 'ripgrep'
brew 'task'
brew 'xh'
brew 'yazi'
brew 'zellij'
brew 'zoxide'

# docker
cask 'orbstack'

# editors
brew 'neovim'
cask 'cursor'

# dev
brew 'gh'
brew 'mise'
brew 'uv'
brew 'lazydocker'
brew 'shellcheck'
brew 'shfmt'
brew 'tree-sitter-cli'

# browsers
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'arc'

# password managers
cask '1password'

# work: cloud & infra
brew 'awscli'
brew 'aws-sam-cli'
brew 'aws-vault'
cask 'session-manager-plugin'
cask 'gcloud-cli'
brew 'cloud-sql-proxy'
brew 'docker'
brew 'kubernetes-cli'
brew 'k9s'
brew 'int128/kubelogin/kubelogin'
brew 'pulumi'
brew 'infisical/get-cli/infisical'

# work: dev
brew 'shopify/shopify/shopify-cli'
brew 'postgresql@16'
brew 'lazygit'
cask 'tableplus'
cask 'bruno'

# work: apps
cask 'slack'
cask 'caffeine'

# misc
cask 'obsidian'
